Revit 2027 API
RebarUpdateCurvesData.GetBendingRadius Method
 Gets the current bending radius of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetBendingRadius()
Public Function GetBendingRadius As Double
public:
double GetBendingRadius()
member GetBendingRadius : unit -> float
Return Value
Double
 Returns the current bending radius of the rebar.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace